import org.junit.Assert.*
import org.junit.Test

/*
вход:
    Функция должна принимать число количество цифр которого от 2 до 8\
условия:
    Выигрышный билет - сумма левой половины номера равна сумме правой половины
результат:
    Тру если победа фолс если поражение
 */
class LotteryValidationTest {

    @Test
    fun test_valid() {
        val ticket = LotteryValidation.Base()

        val listValid = listOf<Long>(
            11, 22, 33, 44, 55, 66, 77, 88, 99,
            1111, 2222, 3333, 4444, 5555, 6666, 7777, 8888, 9999,
            111_111, 222_222, 333_333, 444_444, 555_555, 666_666, 777_777, 888_888, 999_999,
            1111_1111, 2222_2222, 3333_3333, 4444_4444, 5555_5555, 6666_6666, 7777_7777, 8888_8888, 9999_9999,
            9000_1260, 9010_5050, 7300_1270, 5550_7710, 6540_5550, 7700_8600, 9060_5055, 1045_5050, 8081_9070
        )
        listValid.forEach { result ->
            assertEquals(true, ticket.valid(result.toLong()))
        }
    }

    @Test
    fun test_invalid() {
        val ticket = LotteryValidation.Base()

        val listValid = listOf<Long>(
            15, 20, 38, 49, 56, 60, 71, 82, 90,
            1161, 9222, 3033, 4446, 5557, 6966, 78777, 8898, 9099,
            151_118, 282_221, 323_337, 144_464, 155_555, 6661_666, 777_7277, 8488_888, 999_9599,
            1111_1151, 2222_2222, 3313_3333, 4414_4444, 5515_5555, 6666_6668, 7777_7778, 888_8988, 9999_9909,
            9000_1208, 9010_5050, 73002_1270, 5550_2710, 6540_2550, 7710_8630, 9060_5355, 1045_5030, 8081_9070
        )

        listValid.forEach { result ->
            assertEquals(false, ticket.valid(result))
        }
    }

    @Test(expected = IllegalArgumentException::class)
    fun `test exception`() {
        val ticket = LotteryValidation.Base()

        val listValid = listOf<Long>(
            1, 2, 3, 4, 5, 6, 7, 8, 9, 0,
            15, 20, 38, 49, 56, 60, 71, 82, 90,
            1161, 9222, 3033, 4446, 5557, 6966, 78777, 8898, 9099,
            151_118, 282_221, 323_337, 144_464, 155_555, 6661_666, 777_7277, 8488_888, 999_9599,
            1111_11511, 22222_2222, 33313_3333, 44144_4444, 55515_5555, 6666_66686, 7777_77787, 888_88988, 9999_99099,
            9000_12608, 90110_5050, 73002_1270, 5550_27710, 6540_25550, 770110_86030, 9060_53055, 1045_50530, 8081_90570
        )

        listValid.forEach { result ->
            assertEquals(true, ticket.valid(result))
        }
    }
}